Repository: MakiDevelop/NekoPress
Catalog: NekoPress/*.lproj/Localizable.strings
Languages: ar, de, es, fr, it, jp, pt, zh_hant

# toggle_dark_mode
source: Dark Mode
jp: ダークモード
zh_hant: 夜間模式

# hint_compression_quality
source: Compression level affects quality and file size: Fast → More compression but lower quality, Slow → Less compression but better quality
jp: 圧縮レベルによって画質とファイルサイズが変わります：速い → 小さいが画質が悪い、遅い → 画質は良いがファイルが大きい
zh_hant: 壓縮等級會影響畫質與檔案大小：快 → 壓縮多但畫質差，慢 → 壓縮少但畫質好

# label_compression_level
source: Compression Level
ar: مستوى الضغط
de: Komprimierungsstufe
es: Nivel de compresión
fr: Niveau de compression
it: Livello di compressione
jp: 圧縮レベル
pt: Nível de compactação
zh_hant: 壓縮等級

# label_output_format
source: Output Format
ar: صيغة الإخراج
de: Ausgabeformat
es: Formato de salida
fr: Format de sortie
it: Formato di output
jp: 出力形式
pt: Formato de saída
zh_hant: 輸出格式

# button_choose_output_folder
source: Choose Output Folder
ar: اختيار مجلد الإخراج
de: Ausgabeordner wählen
es: Elegir carpeta de salida
fr: Choisir le dossier de sortie
it: Scegli cartella di output
jp: 出力フォルダを選択
pt: Escolher pasta de saída
zh_hant: 選擇輸出資料夾

# toggle_backup_original
source: Backup Original to Origin Folder
jp: 元画像を Origin フォルダにバックアップする
zh_hant: 備份原圖到 Origin 資料夾

# text_saved_summary
source: Total saved: %.2f KB (%.1f%%)
ar: إجمالي التوفير: %.2f كيلوبايت (%.1f %%)
de: Insgesamt %.2f KB (%.1f%%) eingespart
es: Total reducido: %.2f KB (%.1f %%)
fr: Réduction totale : %.2f KB (%.1f %%)
it: Totale ridotto: %.2f KB (%.1f %%)
jp: 合計 %.2f KB（%.1f%%）削減
pt: Total reduzido: %.2f KB (%.1f %%)
zh_hant: 總共減少 %.2f KB（%.1f%%）

# button_start_compression
source: Start Compression
jp: 圧縮を開始
zh_hant: 開始壓縮

# button_cancel_compression
source: Cancel
jp: 圧縮をキャンセル
zh_hant: 取消壓縮

# button_clear_all
source: Clear All
jp: すべての画像をクリア
zh_hant: 清除所有圖片

# alert_compression_failed
source: Compression Failed
ar: فشل ضغط الملفات
de: Komprimierung fehlgeschlagen
es: La compresión falló
fr: Échec de la compression
it: Compressione non riuscita
jp: 圧縮に失敗しました
pt: Falha na compactação
zh_hant: 壓縮失敗

# error_cannot_load_image
source: Cannot load image: %@
ar: تعذّر تحميل الصورة: %@
de: Bild kann nicht geladen werden: %@
es: No se puede cargar la imagen: %@
fr: Impossible de charger l’image : %@
it: Impossibile caricare l'immagine: %@
jp: 画像を読み込めません：%@
pt: Não foi possível carregar a imagem: %@
zh_hant: 無法載入圖片：%@

# error_cannot_write_file
source: Cannot write file: %@
ar: تعذّرت كتابة الملف: %@
de: Datei kann nicht geschrieben werden: %@
es: No se puede escribir el archivo: %@
fr: Impossible d’écrire le fichier : %@
it: Impossibile scrivere il file: %@
jp: ファイルの書き込みに失敗しました：%@
pt: Não foi possível gravar o arquivo: %@
zh_hant: 無法寫入檔案：%@

# error_cannot_delete_file
source: Cannot delete source file: %@
ar: تعذّر حذف الملف الأصلي: %@
de: Quelldatei kann nicht gelöscht werden: %@
es: No se puede eliminar el archivo original: %@
fr: Impossible de supprimer le fichier source : %@
it: Impossibile eliminare il file originale: %@
jp: 元のファイルを削除できません：%@
pt: Não foi possível excluir o arquivo original: %@
zh_hant: 無法刪除來源檔案：%@

# drop_hint
source: Drag images here
jp: ここに画像をドラッグ
zh_hant: 拖曳圖片到此處

# about_button
source: About NekoPress
jp: NekoPressについて
zh_hant: 關於 NekoPress

# about_title
source: NekoPress
jp: NekoPressについて

# about_version
source: Version %@
jp: バージョン 1.4
zh_hant: 版本 1.4

# about_languages
source: Supported Languages: English, Chinese (Simplified/Traditional), Japanese, Korean, German, French, Spanish, Portuguese, Italian, Arabic
jp: 対応言語：繁体字中国語、英語、日本語
zh_hant: 支援語言：繁體中文、English、日本語

# about_close
source: Close
jp: 閉じる
zh_hant: 關閉

# app_subtitle
source: Smart Image Compression Tool
ar: أداة ذكية لضغط الصور
de: Intelligentes Bildkompressionswerkzeug
es: Herramienta inteligente de compresión de imágenes
fr: Outil intelligent de compression d’images
it: Strumento intelligente di compressione immagini
jp: スマート画像圧縮ツール
pt: Ferramenta inteligente de compactação de imagens
zh_hant: 智能圖片壓縮工具

# label_images_selected
source: %d images selected
ar: تم اختيار %d صورة
de: %d Bilder ausgewählt
es: %d imágenes seleccionadas
fr: %d images sélectionnées
it: %d immagini selezionate
jp: %d枚の画像を選択
pt: %d imagens selecionadas
zh_hant: 已選擇 %d 張圖片

# label_output_folder
source: Output Folder
ar: مجلد الإخراج
de: Ausgabeordner
es: Carpeta de salida
fr: Dossier de sortie
it: Cartella di output
jp: 出力フォルダ
pt: Pasta de saída
zh_hant: 輸出資料夾

# button_select_folder
source: Choose
ar: اختيار
de: Auswählen
es: Elegir
fr: Choisir
it: Scegli
jp: 選択
pt: Escolher
zh_hant: 選擇

# button_same_as_input
source: Same as input images
ar: نفس مجلد الإدخال
de: Wie Eingabebilder
es: Igual que la carpeta de origen
fr: Identique au dossier d’entrée
it: Uguale alla cartella di origine
jp: 入力画像と同じディレクトリ
pt: Igual à pasta de origem
zh_hant: 與輸入圖片相同目錄

# label_delete_source_files
source: Delete Original Files
ar: حذف الملفات الأصلية
de: Quelldateien löschen
es: Eliminar archivos originales
fr: Supprimer les fichiers d’origine
it: Elimina file originali
jp: 元のファイルを削除
pt: Excluir arquivos originais
zh_hant: 刪除原始檔案

# label_compressing
source: Compressing...
ar: جاري الضغط...
de: Komprimiere...
es: Comprimiendo...
fr: Compression en cours...
it: Compressione in corso...
jp: 圧縮中...
pt: Compactando...
zh_hant: 正在壓縮...

# button_start
source: Start Compression
ar: بدء الضغط
de: Komprimierung starten
es: Iniciar compresión
fr: Démarrer la compression
it: Avvia compressione
jp: 圧縮を開始
pt: Iniciar compactação
zh_hant: 開始壓縮

# button_cancel
source: Cancel
ar: إلغاء
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
jp: キャンセル
pt: Cancelar
zh_hant: 取消

# button_clear
source: Clear All
ar: مسح الكل
de: Alle löschen
es: Borrar todo
fr: Tout effacer
it: Cancella tutto
jp: すべてクリア
pt: Limpar tudo
zh_hant: 清除全部

# button_about
source: About
ar: حول التطبيق
de: Info
es: Acerca de
fr: À propos
it: Info
jp: について
pt: Sobre
zh_hant: 關於

# about_app_title
source: Smart Image Compression Tool
jp: スマート画像圧縮ツール
zh_hant: 智能圖片壓縮工具

# about_version_number
source: Version %@
ar: الإصدار %@
es: Versión %@
it: Versione %@
jp: バージョン 1.4
pt: Versão %@
zh_hant: 版本 1.4

# about_supported_languages
source: Supported Languages: English, Chinese (Simplified/Traditional), Japanese, Korean, German, French, Spanish, Portuguese, Italian, Arabic
ar: اللغات المدعومة: الإنجليزية، الصينية (مبسطة/تقليدية)، اليابانية، الكورية، الألمانية، الفرنسية، الإسبانية، البرتغالية، الإيطالية، العربية
de: Unterstützte Sprachen: Englisch, Chinesisch (vereinfacht/traditionell), Japanisch, Koreanisch, Deutsch, Französisch, Spanisch, Portugiesisch, Italienisch, Arabisch
es: Idiomas compatibles: inglés, chino (simplificado/tradicional), japonés, coreano, alemán, francés, español, portugués, italiano, árabe
fr: Langues prises en charge : anglais, chinois (simplifié/traditionnel), japonais, coréen, allemand, français, espagnol, portugais, italien, arabe
it: Lingue supportate: inglese, cinese (semplificato/tradizionale), giapponese, coreano, tedesco, francese, spagnolo, portoghese, italiano, arabo
jp: 対応言語：繁体字中国語、英語、日本語
pt: Idiomas compatíveis: inglês, chinês (simplificado/tradicional), japonês, coreano, alemão, francês, espanhol, português, italiano, árabe
zh_hant: 支援語言：繁體中文、English、日本語

# button_close
source: Close
ar: إغلاق
de: Schließen
es: Cerrar
fr: Fermer
it: Chiudi
jp: 閉じる
pt: Fechar
zh_hant: 關閉

# drop_area_hint
source: Drag images here
ar: اسحب الصور إلى هنا
de: Bilder hierher ziehen
es: Arrastra las imágenes aquí
fr: Déposez les images ici
it: Trascina qui le immagini
jp: ここに画像をドラッグ
pt: Arraste as imagens aqui
zh_hant: 拖拽圖片到此處

# drop_area_formats
source: Supports JPG, PNG, BMP, HEIC, WebP formats
ar: الصيغ المدعومة: JPG وPNG وBMP وHEIC وWebP
de: Unterstützt JPG, PNG, BMP, HEIC, WebP
es: Formatos compatibles: JPG, PNG, BMP, HEIC, WebP
fr: Formats pris en charge : JPG, PNG, BMP, HEIC, WebP
it: Formati supportati: JPG, PNG, BMP, HEIC, WebP
jp: 対応形式：JPG、PNG、BMP、HEIC、WebP
pt: Formatos compatíveis: JPG, PNG, BMP, HEIC, WebP
zh_hant: 支援 JPG、PNG、BMP、HEIC、WebP 格式

# compression_level_fast
source: Fast
ar: سريع
de: Schnell
es: Rápido
fr: Rapide
it: Veloce
jp: 速い
pt: Rápido
zh_hant: 快

# compression_level_medium
source: Medium
ar: متوسط
de: Mittel
es: Medio
fr: Moyen
it: Medio
jp: 標準
pt: Médio
zh_hant: 中

# compression_level_slow
source: Slow
ar: بطيء
de: Langsam
es: Lento
fr: Lent
it: Lento
jp: 遅い
pt: Lento
zh_hant: 慢

# error_backup_failed
source: Backup failed: %@
jp: バックアップ失敗：%@
zh_hant: 備份失敗：%@

# warning_some_backups_failed
source: Some files failed to backup
jp: 一部のファイルのバックアップに失敗しました
zh_hant: 部分檔案備份失敗

# error_cannot_create_backup_folder
source: Cannot create backup folder: %@
jp: バックアップフォルダを作成できません：%@
zh_hant: 無法建立備份資料夾：%@

# accessibility_dark_mode_toggle
source: Toggle dark mode
ar: تبديل الوضع الداكن
de: Dunkelmodus umschalten
es: Activar/desactivar el modo oscuro
fr: Activer/désactiver le mode sombre
it: Attiva/disattiva modalità scura
jp: ダークモードを切り替え
pt: Alternar modo escuro
zh_hant: 切換深色模式

# accessibility_compression_level
source: Select compression level
ar: اختيار مستوى الضغط
de: Komprimierungsstufe wählen
es: Seleccionar nivel de compresión
fr: Choisir le niveau de compression
it: Seleziona il livello di compressione
jp: 圧縮レベルを選択
pt: Selecionar nível de compactação
zh_hant: 選擇壓縮等級

# accessibility_output_format
source: Select output format
ar: اختيار صيغة الإخراج
de: Ausgabeformat wählen
es: Seleccionar formato de salida
fr: Choisir le format de sortie
it: Seleziona il formato di output
jp: 出力形式を選択
pt: Selecionar formato de saída
zh_hant: 選擇輸出格式

# accessibility_select_output_folder
source: Select output folder
jp: 出力フォルダを選択
zh_hant: 選擇輸出資料夾

# accessibility_delete_source_toggle
source: Enable or disable deleting original files
ar: تفعيل أو إيقاف حذف الملفات الأصلية
de: Löschen der Quelldateien ein- oder ausschalten
es: Activar o desactivar eliminar archivos originales
fr: Activer ou désactiver la suppression des fichiers d’origine
it: Attiva o disattiva l’eliminazione dei file originali
jp: 元のファイルの削除を有効または無効にする
pt: Ativar ou desativar exclusão dos arquivos originais
zh_hant: 啟用或停用刪除原始檔案

# accessibility_start_compression
source: Start compressing images
ar: بدء ضغط الصور
de: Bildkomprimierung starten
es: Iniciar la compresión de imágenes
fr: Démarrer la compression des images
it: Avvia la compressione delle immagini
jp: 画像の圧縮を開始
pt: Iniciar a compactação das imagens
zh_hant: 開始壓縮圖片

# accessibility_cancel_compression
source: Cancel compression
ar: إلغاء عملية الضغط
de: Komprimierung abbrechen
es: Cancelar la compresión
fr: Annuler la compression
it: Annulla la compressione
jp: 圧縮をキャンセル
pt: Cancelar a compactação
zh_hant: 取消壓縮

# accessibility_clear_all
source: Clear all images
ar: مسح كل الصور
de: Alle Bilder entfernen
es: Eliminar todas las imágenes
fr: Supprimer toutes les images
it: Rimuovi tutte le immagini
jp: すべての画像をクリア
pt: Limpar todas as imagens
zh_hant: 清除所有圖片

# accessibility_about
source: About NekoPress
ar: حول NekoPress
de: Informationen zu NekoPress
es: Acerca de NekoPress
fr: À propos de NekoPress
it: Informazioni su NekoPress
jp: NekoPressについて
pt: Sobre o NekoPress
zh_hant: 關於 NekoPress

# accessibility_drop_area
source: Drop area for images, %d images selected
ar: منطقة إسقاط الصور، تم اختيار %d صورة
de: Ablagebereich für Bilder, %d Bilder ausgewählt
es: Zona para soltar imágenes, %d imágenes seleccionadas
fr: Zone de dépôt des images, %d images sélectionnées
it: Area di rilascio delle immagini, %d immagini selezionate
jp: 画像のドロップエリア、%d枚の画像が選択されています
pt: Área para soltar imagens, %d imagens selecionadas
zh_hant: 拖放圖片區域，已選擇 %d 張圖片

# accessibility_progress
source: Compression progress %d%%
ar: تقدم الضغط %d%%
de: Komprimierungsfortschritt %d%%
es: Progreso de compresión %d%%
fr: Progression de la compression %d%%
it: Avanzamento della compressione %d%%
jp: 圧縮進捗 %d%%
pt: Progresso da compactação %d%%
zh_hant: 壓縮進度 %d%%

# button_ok
source: OK
ar: حسناً
es: Aceptar
zh_hant: 確定
